Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L10.tmx
Source language: en_us
Languages: zh_cn

source: Paranoia
zh_cn: 疑神疑鬼

source: Mr. Halloran Beresford, pleasantly tired after a good day in the office, still almost clean-shaven after eight hours, his pants still neatly pressed, pleased with himself particularly for remembering, stepped out of the candy shop with a great box under his arm and started briskly for the corner.
zh_cn: 在办公室度过愉快的一天后，郝罗兰·贝雷斯福特先生感到劳累却又满足。他在办公室呆了八小时后，面颊仍然清爽，裤子仍然平整。没有忘记今天是妻子的生日，因此他觉得心满意足，腋下夹着一个大盒子走出了糖果商店，轻快地往车站走去。

source: There were twenty small-size gray suits like Mr. Beresford's on every New York block, fifty men still clean-shaven and pressed after a day in an air-cooled office, a hundred small men, perhaps, pleased with themselves for remembering their wives' birthdays.
zh_cn: 在纽约，像郝罗兰穿的那套小号灰色西装，每一栋大楼里都有二十套；在吹着空调的办公室里工作一天后，五十个人仍然面颊清爽，衣着平整；或许还有一百个渺小的男人，因为记住了妻子的生日而自满自足。

source: Mr. Beresford was going to take his wife out to dinner, he decided, going to see if he could get last-minute tickets to a show, taking his wife candy.
zh_cn: 郝罗兰打算带妻子出来共进晚餐，他决定去看看是否能赶点买到看演出的票，决定给妻子买些糖果。

source: It had been an exceptionally good day, altogether, and Mr. Beresford walked along swiftly, humming musically to himself.
zh_cn: 总的说来，今天是尤其愉快的一天，郝罗兰迈着有力的步伐，自顾自地哼着小曲儿。

source: He stopped on the corner, wondered whether he would save more time by taking a bus or by trying to catch a taxi in the crowd.
zh_cn: 他走到车站停了下来，考虑自己是坐公交更省时间，还是在人群中打车更省时间。

source: It was a long trip downtown and Mr. Beresford ordinarily enjoyed the quiet half hour on top of a Fifth Avenue bus, perhaps reading his paper.
zh_cn: 到市区有很长一段路，他通常很享受在第五大道公交车顶层度过的那安静的半个小时，或许还可以读读报纸。

source: He disliked the subway intensely, and found the public display and violent exercise necessary to catch a taxi usually more than he was equal to.
zh_cn: 他尤其不喜欢坐地铁，而且他还发现，打出租需要的公共举止与暴力勇猛，往往都在他的能力之外。

source: However, tonight he had spent a lot of time waiting in line in the candy store to get his wife's favorite chocolates, and if he were going to get home before dinner was on the table he really had to hurry a little.
zh_cn: 不过，今晚他还是花了不少时间在糖果店排队，为妻子买到她最爱的巧克力。他真打算在妻子把饭菜摆上桌前到家的话，他就得再抓紧一点。

source: Mr. Beresford went a few steps into the street, waved at a taxi, said "Taxi!" in a voice that went helplessly into a falsetto, and slunk back, abashed, to the sidewalk while the taxi went by uncomprehending.
zh_cn: 郝罗兰往车道上走了几步，向一辆出租招了招手，喊：“出租！”他的声音无望地变成了假声。出租车无视他开了过去，他又灰溜溜地走回人行道，颇为尴尬。

source: A man in a light hat stopped next to Mr. Beresford on the sidewalk and for a minute, in the middle of the crowd, he stared at Mr. Beresford and Mr. Beresford stared at him as people sometimes do without caring particularly what they see.
zh_cn: 人行道上，一个戴浅色帽子的男子走到贝雷斯福特先生边上。他俩在人群中，无意识地相互对视了片刻，就像人们有时看着别人，又没有特别在意自己到底看到什么一样。

source: What Mr. Beresford saw was a thin face under the light hat, a small mustache, a coat collar turned up.
zh_cn: 郝罗兰看到的，是浅色帽子下的瘦小脸孔、小胡子、竖起的衣领。

source: Funny-looking guy, Mr. Beresford thought, lightly touching his clean-shaven lip.
zh_cn: 郝罗兰轻轻摸了摸自己刮掉胡须的嘴边，心想，这人长得真滑稽。

source: Perhaps the man thought Mr. Beresford's almost unconscious gesture was offensive; at any rate he frowned and looked Mr. Beresford up and down before he turned away.
zh_cn: 或许那男子觉得郝罗兰这个下意识的动作有些冒犯，他皱起眉头，从上到下把郝罗兰打量了一番，然后转过身去了。

source: Ugly customer, Mr. Beresford thought.
zh_cn: 郝罗兰心想，丑陋的家伙。

source: The Fifth Avenue bus Mr. Beresford usually took came slipping up to the corner and Mr. Beresford, pleased not to worry about a taxi, started for the stop.
zh_cn: 郝罗兰常乘坐的那趟第五大道公交缓缓进站，郝罗兰因为不再揪心打车的事，高高兴兴往公交站牌走去。

source: He had reached out his hand to take the rail inside the bus door when he was roughly elbowed aside and the ugly customer in the light hat shoved on ahead of him.
zh_cn: 郝罗兰已经伸手拉住了公交车门内的扶手，可这时上车的乘客粗鲁地把他挤到了一边，那个戴浅色帽子的男子也凶狠地挤到了他前面。

source: Mr. Beresford muttered and started to follow, but the bus door closed on the packed crowd inside and the last thing Mr. Beresford saw as the bus went off down the street was the man in the light hat grinning at him from inside the door.
zh_cn: 郝罗兰嘟哝着跟在后面，可是车门却在挤成一团的乘客身后关上，然后公车就起步离去了，郝罗兰只看见那个戴浅色帽子的男人隔着车门对他咧嘴一笑。

source: "There's a dirty trick," Mr. Beresford told himself, and settled his shoulders irritably in his coat.
zh_cn: “开什么玩笑，”郝罗兰自言自语，然后愤怒地抖了抖大衣里面的肩膀。

source: Still under the influence of his annoyance, he ran a few steps out into the street and waved again at a taxi, not trusting his voice, and was almost run down by a delivery truck.
zh_cn: 气还没有消，他就又往车道上走了几步，闭着口（他不再相信自己的声音）向一辆出租车招手，可一辆送货卡车差点撞上了他。

source: As Mr. Beresford skidded back to the sidewalk the truck driver leaned out and yelled something unrecognizable at Mr. Beresford and when Mr. Beresford saw the people around him on the corner laughing he decided to start walking downtown; in two blocks he would reach another bus stop, a good corner for taxis, and a subway station; much as Mr. Beresford disliked the subway, he might still have to take it, to get home in any sort of time.
zh_cn: 他又回到人行道，卡车司机探出身子，对着他吼了一通听不清的话。发觉周围的人都在取笑自己后，他下决心要往市区走几步。走上两个街区，就会有另一个车站，在那儿可以坐公交，也好打车，而且还有一个地铁站。他虽然不喜欢坐地铁，但是为了及时到家，他可能也会迫不得已。

source: Walking downtown, his candy box under his arm, his gray suit almost unaffected by the crush on the corner, Mr. Beresford decided to swallow his annoyance and remember it was his wife's birthday; he began to hum again as he walked.
zh_cn: 他腋下夹着糖果盒往市区行进，刚才坐车拥挤过后，他的西服仍然平整如初。他决定咽下自己的不快，他没有忘记今天是妻子的生日。迈着步子时，他又开始哼唱起来。

source: He watched the people as he walked along, his perspective sharpened by being a man who has just succeeded in forgetting an annoyance; surely the girl in the very high-heeled shoes, coming toward him with a frown on her face, was not so able to put herself above petty trifles, or maybe she was frowning because of the shoes; the old lady and man looking at the shop windows were quarrelling.
zh_cn: 他边走边观察别人。因为成功咽下自己的不快，他的洞察力变得敏锐起来。那个穿着超级高跟鞋、皱着眉头向他走来的女孩，肯定是没法很好处理一些琐事，或者是因为那双鞋才皱着眉头。一个老太太和一个男子，一边看着商店橱窗，一边在吵嘴。

source: The funny-looking guy in the light hat coming quickly through the crowd looked as though he hated someone . . . the funny-looking guy in the light hat; Mr. Beresford turned clean around in the walking line of people and watched the man in the light hat turn abruptly and start walking downtown, about ten feet in back of Mr. Beresford.
zh_cn: 一个长像滑稽、戴浅色帽子的男人，快速穿过人群走过来，他看上去好像和某人有深仇大恨一样......长像滑稽、戴浅色帽子的男人，郝罗兰在行进的人群中干脆利落地转过身，看着那个戴浅色帽子的男人。他在郝罗兰身后三四米远的地方突然转身，然后往市区方向走来。

source: What do you know about that, Mr. Beresford marvelled to himself, and began to walk a little quickly.
zh_cn: 真搞不懂，郝罗兰自言自语，然后稍微加快了脚步。

source: Probably got off the bus for some reason, wrong bus maybe. Then why would he start walking uptown instead of catching another bus where he was?
zh_cn: 那男的有可能是坐错了车，所以才下了公交车，可是他为什么不就在下车那儿换一趟车，反而要往反方向走呢？

source: Mr. Beresford shrugged and passed two girls walking together and talking both at once.
zh_cn: 郝罗兰耸耸肩，与两个同时说着话的女孩擦身而过。

source: Halfway from the corner he wanted, Mr. Beresford realized with a sort of sick shock that the man in the light hat was at his elbow, walking steadily along next to him.
zh_cn: 离目的地还有一半的路程时，郝罗兰又苦恼又惊讶地发现，那个戴浅色帽子的男人就在紧挨着自己，在自己边上稳健地向前走。

source: Mr. Beresford turned his head the other way and slowed his step.
zh_cn: 郝罗兰把头转向另外一边，放慢脚步。

source: The other man slowed down as well, without looking at Mr. Beresford.
zh_cn: 那男人没有看郝罗兰一眼，也跟着放慢脚步。

source: Nonsense, Mr. Beresford thought, without troubling to work it out any further than that.
zh_cn: 搞笑，郝罗兰心想着，下意识地作出了进一步行动。

source: He settled his candy box firmly under his arm and cut abruptly across the uptown line of people and into a shop, a souvenir and notion shop, he realized as he came through the door.
zh_cn: 他把腋下的糖果盒子夹紧，突然穿过比肩接踵的人群，走进一家商店。走进门后，他才发现这是一家卖纪念品和小物件的商店。

source: There were two or three people inside- a woman and a little girl, a sailor- and Mr. Beresford retired to the far end of the counter and began to fuss with an elaborate cigarette box on which was written "Souvenir of New York City," with a trylon and a perisphere painted beneath.
zh_cn: 店里有三人，一个妇女，一个小女孩，还有一个水手。郝罗兰走到货柜最里端，拿起一个精美的香烟盒捣腾。烟盒上写着“纽约市留念”，字下面画着1939年纽约世博会的主体建筑物——角尖塔和圆球。

source: "Isn't this cute?" the mother said to the little girl, and they both began to laugh enormously over the match holder made in the form of a toilet; the matches were to go in the bowl, and on the cover, Mr. Beresford could see, was a trylon and a perisphere, with "Souvenir of New York City" written above.
zh_cn: “这个可爱吧？”妇女对小女儿说，然后二人看着那个马桶形状的火柴盒大声的笑起来。火柴装在马桶里，而且郝罗兰还看得见，马桶盖上画的是角尖塔和圆球，角尖塔和圆球上方写着“留念纽约市”。

source: The man in the light hat came into the shop and Mr. Beresford turned his back and busied himself picking up one thing after another from the counter; with half his mind he was trying to find something that did not say "Souvenir of New York City" and with the other half of his mind he was wondering about the man in the light hat.
zh_cn: 戴浅色帽子的男子走进商店，郝罗兰转身背对着他，忙着一个接一个地从货柜上挑选东西。他一半心思放在寻找没有写“纽约市留念”的东西上，另外一半放在那个戴浅色帽子的男人身上。

source: The question of what the man in the light hat wanted was immediately subordinate to the question of whom he wanted; if his light-hatted designs were against Mr. Beresford they must be nefarious, else why had he not announced them before now?
zh_cn: 这个男人冲着什么来已经不再重要，重要的是他是冲着谁来的。如果他戴浅色帽子的打扮是某种冲着郝罗兰来的阴谋，那么这种阴谋肯定是邪恶的，不然他为什么不之前就讲清楚呢？

source: The thought of accosting the man and demanding his purpose crossed Mr. Beresford's mind fleetingly, and was succeeded, as always in an equivocal situation, by Mr. Beresford's vivid recollection of his own small size and innate cautiousness.
zh_cn: 贸然上前搭话，问那男的想干嘛的念头在郝罗兰脑中一闪而过，可是和往常遇到这种情况时一样，他接着就回想起自己的矮小身材和天生谨慎的性格。

source: Best, Mr. Beresford decided, to avoid this man.
zh_cn: 他决定自己最好避开这个男人。

source: Thinking this, Mr. Beresford walked steadily toward the doorway of the shop, intending to pass the man in the light hat and go out and catch his bus home.
zh_cn: 想着，他稳健走向店门，打算从这个戴浅色帽子的男人身边经过，出去搭公交回家。

source: He had not quite reached the man in the light hat when the shop's clerk came around the end of the counter and met Mr. Beresford with a genial smile and a vehement "See anything you like, Mister?"
zh_cn: 郝罗兰还没有走到那个男人那儿，商店店员就从货柜一头走过来，对着他友好一笑，热情地问，“看到喜欢的东西了吗？先生。”

source: "Not tonight, thanks," Mr. Beresford said, moving left to avoid the clerk, but the clerk moved likewise and said, "Got some nice things you didn't look at."
zh_cn: “今晚还没有看到，谢谢，”郝罗兰说着，往左边挪了挪，让开了店员。可是店员也往左边移步，说，“有些好东西你可没有看到。”

source: "No, thanks," Mr. Beresford said, trying to make his tenor voice firm.
zh_cn: “不用看了，谢谢，”郝罗兰说，他试着把自己普通的说话声变得坚定些。

source: "Take a look at it," the clerk insisted.
zh_cn: “看一看嘛，”店员说。

source: This was unusually persistent even for such a clerk; Mr. Beresford looked up and saw the man in the light hat on his right, bearing down on him.
zh_cn: 这个店员的固执有些不寻常。郝罗兰抬头，看见戴浅色帽子的男人就在自己右边。

source: Over the shoulders of the two men he could see that the shop was empty.
zh_cn: 从二人的肩上望过去，他看见商店里空无一人。

source: The street looked very far away, the people passing in either direction looked smaller and smaller; Mr. Beresford realized that he was being forced to step backward as the two men advanced on him.
zh_cn: 街道看上去很远，街上来来往往的人看上去越来越小。二人向他逼近，他意识到自己正被逼迫着往后退。

source: "Easy does it," the man in the light hat said to the clerk.
zh_cn: “慢慢来，”戴浅色帽子的男人对店员说。

source: They continued to move forward slowly.
zh_cn: 二人继续向前缓缓逼近。

source: "See here now," Mr. Beresford said, with the ineffectuality of the ordinary man caught in such a crisis; he still clutched his box of candy under his arm.
zh_cn: “别过来，”郝罗兰说，话语中显示出他这个身陷囹圄的普通人的无能为力。他腋下仍然夹着糖果盒子。

source: "See here," he said, feeling the solid weight of the wall behind him.
zh_cn: “别过来，”他说，感觉到了背后坚硬的墙壁。

source: "Ready," the man in the light hat said.
zh_cn: “准备，”戴浅色帽子的人说。

source: The two men tensed and Mr. Beresford, with a wild yell, broke between them and ran for the door.
zh_cn: 二人蓄势待发，郝罗兰大叫一声，撞开二人往门口跑去。

source: He heard a sound more like a snarl than anything else behind him and the feet coming after him.
zh_cn: 他听见背后一声咆哮，听到追他而来的脚步声。

source: I'm safe on the street, Mr. Beresford thought as he came through the door into the line of people, as long as there are lots of people they can't do anything to me.
zh_cn: 出门跑到行人中间后，他想，到街上我就安全了，街上人多，他们不敢把我怎么样。

source: He looked back, walking downtown between a fat woman with many packages and a girl and a boy leaning on one another's shoulders, and he saw the clerk standing in the door of the shop looking after him; the man with the light hat was not in sight.
zh_cn: 他回头看了看，然后走到一个提着许多包的胖女人和一对相互靠着肩膀的女孩和男孩中间，往市区方向行进。他看见那个店员站在商店门口看着自己，戴浅色帽子的男人已经看不见了。

source: Mr. Beresford shifted the box of candy so that his right arm was free and thought, Perfectly silly. It's still broad daylight. How they ever hoped to get away with it?.?.?.
zh_cn: 他把糖果盒子换到另外一只手，腾出自己的右手，心想，他们真傻，光天化日的，以为能干了坏事能跑得掉吗？

source: The man in the light hat was on the corner ahead, waiting. Mr. Beresford hesitated in his walk and then thought, It's preposterous, all these people watching.
zh_cn: 戴浅色帽子的男人就在前面车站等着，郝罗兰步伐犹豫了一下，然后心想，这人真蠢，这么多人看着呢。

source: He walked boldly down the street; the man in the light hat was not even watching him, but was leaning calmly against a building lighting a cigarette.
zh_cn: 他大胆向前走。那男的甚至都没有看他一眼，只是靠着建筑物，点燃一根香烟。

source: Mr. Beresford reached the corner, darted quickly into the street, and yelled boisterously, "Taxi!" in a great voice he had never suspected he possessed until now.
zh_cn: 郝罗兰走到车站，快步走上车道，大喊一声，“出租。”在这之前他从来没有想过自己有这么大的声音。

source: A taxi stopped as though not daring to disregard that great shout, and Mr. Beresford moved gratefully toward it.
zh_cn: 一辆出租似乎不敢无视他的大喊，停了下来。

source: His hand was on the door handle when another hand closed over his and Mr. Beresford was aware of the light hat brushing his cheek.
zh_cn: 郝罗兰满怀感激往出租走去。他手才放到车门把手上，另外又有一只手就握住了他的手。他感觉到那顶浅色帽子轻轻碰到了自己的脸庞。

source: "Come on if you're coming," the taxi driver said; the door was open and Mr. Beresford, resisting the push that urged him into the taxi, slipped his hand out from under the other hand and ran back to the sidewalk.
zh_cn: “要走就快点，”的哥说。车门开着，然而郝罗兰无视的哥的催促，从那只手里把自己的手抽出来，跑回了人行道上。

source: A crosstown bus had stopped on the corner and Mr. Beresford, no longer thinking, hurried into it, dropped a nickel into the coin register, and went to the back of the bus and sat down.
zh_cn: 一辆经过市区的公交停在车站，郝罗兰不及多想，匆忙上来车，往投币箱里投了一个五分硬币，然后走到公交车尾部坐了下来。

source: The man in the light hat sat a little ahead, between Mr. Beresford and the door.
zh_cn: 戴浅色帽子的男人坐在前面不远处，夹在郝罗兰和车门中间。

source: Mr. Beresford put his box of candy on his lap and tried to think.
zh_cn: 郝罗兰把糖果盒子放在腿上，努力思考。

source: Obviously the man in the light hat was not carrying a grudge all this time about Mr. Beresford's almost unconscious gesture toward the mustache, unless he were peculiarly sensitive.
zh_cn: 显然，这个戴浅色帽子的男人并非对郝罗兰那个几乎下意识的摸胡须动作耿耿于怀，除非他真的有那么敏感。

source: In any case, there was the clerk in the souvenir shop; Mr. Beresford realized suddenly that the clerk in the souvenir shop was a very odd circumstance indeed.
zh_cn: 不管怎样，那个店员一直都在纪念品商店里。郝罗兰突然意识到，那个商店就是一个很奇怪的环境。

source: He set the clerk aside to think about later and went back to the man in the light hat.
zh_cn: 他把店员撇在一边等会在考虑，然后回到戴浅色帽子的男人身上。

source: If it was not the insult to the mustache, what was it?
zh_cn: 如果不是因为摸胡子的动作冒犯了他，那又是什么呢？

source: And then another thought caught Mr. Beresford breathless: how long, then, had the man in the light hat been following him?
zh_cn: 郝罗兰想到另外一件事，让自己屏气慑息：这个戴浅色帽子的男人跟踪自己多久了？

source: He thought back along the day: he had left his office with a group of people, all talking cheerfully, all reminding Mr. Beresford that it was his wife's birthday; they had escorted Mr. Beresford to the candy shop and left him there.
zh_cn: 他回忆这一天的事情：他和一群人一起离开办公室，大家都有说有笑，提醒郝罗兰今天是妻子的生日；他们陪郝罗兰到了糖果店，然后离开了他。
